---
type: DuctSizeSettingIterator
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 8
tags: [revit-api, class]
---

# DuctSizeSettingIterator

`Autodesk.Revit.DB.Mechanical.DuctSizeSettingIterator` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | HasCurrent | 2013 | `public bool HasCurrent ()` |
| Method | IsDone | 2013 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2013 | `public virtual bool MoveNext ()` |
| Method | Reset | 2013 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual KeyValuePair < DuctShape , DuctSizes > Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |